---------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\user\Documents\GitHub\applied-latex\stata_exports_log_clase.txt
  log type:  text
 opened on:  19 Feb 2025, 18:20:32

. 
. * use a random dataset
. 
. webuse nhanes2l
(Second National Health and Nutrition Examination Survey)

. 
. *** Descriptive statistics --------------------------------
. 
. dtable age weight // does not export

---------------------------
                Summary    
---------------------------
N                    10,351
Age (years) 47.580 (17.215)
Weight (kg) 71.898 (15.356)
---------------------------

. 
. dtable age weight, by(region) // cool group by statistics

-------------------------------------------------------------------------------------------
                                                 Region                                    
                   NE              MW              S               W             Total     
-------------------------------------------------------------------------------------------
N             2,096 (20.2%)   2,774 (26.8%)   2,853 (27.6%)   2,628 (25.4%) 10,351 (100.0%)
Age (years) 47.816 (17.017) 46.528 (17.376) 48.191 (16.864) 47.838 (17.535) 47.580 (17.215)
Weight (kg) 71.646 (14.922) 72.050 (15.340) 72.035 (15.655) 71.787 (15.393) 71.898 (15.356)
-------------------------------------------------------------------------------------------

. 
. dtable age weight, by(region) export("outputs/table_by_region_stata_export.docx")

-------------------------------------------------------------------------------------------
                                                 Region                                    
                   NE              MW              S               W             Total     
-------------------------------------------------------------------------------------------
N             2,096 (20.2%)   2,774 (26.8%)   2,853 (27.6%)   2,628 (25.4%) 10,351 (100.0%)
Age (years) 47.816 (17.017) 46.528 (17.376) 48.191 (16.864) 47.838 (17.535) 47.580 (17.215)
Weight (kg) 71.646 (14.922) 72.050 (15.340) 72.035 (15.655) 71.787 (15.393) 71.898 (15.356)
-------------------------------------------------------------------------------------------
file outputs/table_by_region_stata_export.docx already exists
r(602);

end of do-file

r(602);

. des

Contains data from https://www.stata-press.com/data/r18/nhanes2l.dta
 Observations:        10,351                  Second National Health and Nutrition Examination Survey
    Variables:            42                  23 Mar 2023 10:43
---------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------------------------
sampl           long    %9.0g                 Unique case identifier
strata          byte    %9.0g                 Stratum identifier
psu             byte    %9.0g      psulbl     Primary sampling unit
region          byte    %9.0g      region     Region
smsa            byte    %22.0g     smsalbl    SMSA type
location        byte    %9.0g                 Location (stand office ID)
houssiz         byte    %9.0g                 Number of people in household
sex             byte    %9.0g      sex        Sex
race            byte    %9.0g      race       Race
age             byte    %9.0g                 Age (years)
height          float   %9.0g                 Height (cm)
weight          float   %9.0g                 Weight (kg)
bpsystol        int     %9.0g                 Systolic blood pressure
bpdiast         int     %9.0g                 Diastolic blood pressure
tcresult        int     %9.0g                 Serum cholesterol (mg/dL)
tgresult        int     %9.0g                 Serum triglycerides (mg/dL)
hdresult        int     %9.0g                 High-density lipids (mg/dL)
hgb             float   %9.0g                 Hemoglobin (g/dL)
hct             float   %9.0g                 Hematocrit (%)
tibc            int     %9.0g                 Total iron bind. cap. (mcg/dL)
iron            int     %9.0g                 Serum iron (mcg/dL)
hlthstat        byte    %20.0g     hlth       Health status
heartatk        byte    %16.0g     heartlbl   Prior heart attack
diabetes        byte    %12.0g     diabetes   Diabetes status
sizplace        byte    %39.0g     size       Size of place
finalwgt        long    %9.0g                 Sampling weight (except lead)
leadwt          long    %9.0g                 Sampling weight for lead
corpuscl        float   %9.0g                 Mean corpuscular volume (fL)
trnsfern        float   %9.0g                 Transferrin saturation (%)
albumin         float   %9.0g                 Serum albumin (g/dL)
vitaminc        float   %9.0g                 Serum vitamin C (mg/dL)
zinc            int     %9.0g                 Serum zinc (mcg/dL)
copper          int     %9.0g                 Serum copper (mcg/dL)
porphyrn        int     %9.0g                 Erythrocyte porphyrin (mcg/dl)
lead            byte    %9.0g                 Lead (mcg/dL)
hsizgp          byte    %8.0g                 # in household or 5 if #>=5
rural           byte    %8.0g      rurallbl   Rural
loglead         float   %9.0g                 log(lead)
agegrp          byte    %8.0g      agegrp     Age group
highlead        byte    %10.0g     highlead   High lead level
bmi             float   %9.0g                 Body mass index (BMI)
highbp          byte    %8.0g               * High blood pressure
                                            * indicated variables have notes
---------------------------------------------------------------------------------------------------------------------------------
Sorted by: region

. tab age

Age (years) |      Freq.     Percent        Cum.
------------+-----------------------------------
         20 |        244        2.36        2.36
         21 |        281        2.71        5.07
         22 |        251        2.42        7.50
         23 |        245        2.37        9.86
         24 |        226        2.18       12.05
         25 |        209        2.02       14.07
         26 |        221        2.14       16.20
         27 |        216        2.09       18.29
         28 |        215        2.08       20.37
         29 |        212        2.05       22.41
         30 |        205        1.98       24.39
         31 |        201        1.94       26.34
         32 |        182        1.76       28.09
         33 |        147        1.42       29.51
         34 |        158        1.53       31.04
         35 |        179        1.73       32.77
         36 |        141        1.36       34.13
         37 |        156        1.51       35.64
         38 |        118        1.14       36.78
         39 |        135        1.30       38.08
         40 |        131        1.27       39.35
         41 |        131        1.27       40.61
         42 |        151        1.46       42.07
         43 |        134        1.29       43.37
         44 |        118        1.14       44.51
         45 |        109        1.05       45.56
         46 |        120        1.16       46.72
         47 |        110        1.06       47.78
         48 |        130        1.26       49.04
         49 |        138        1.33       50.37
         50 |        163        1.57       51.95
         51 |        122        1.18       53.13
         52 |        142        1.37       54.50
         53 |        125        1.21       55.70
         54 |        115        1.11       56.82
         55 |        126        1.22       58.03
         56 |        115        1.11       59.14
         57 |        147        1.42       60.56
         58 |        117        1.13       61.69
         59 |        119        1.15       62.84
         60 |        344        3.32       66.17
         61 |        302        2.92       69.09
         62 |        329        3.18       72.26
         63 |        285        2.75       75.02
         64 |        322        3.11       78.13
         65 |        293        2.83       80.96
         66 |        281        2.71       83.67
         67 |        245        2.37       86.04
         68 |        245        2.37       88.41
         69 |        214        2.07       90.47
         70 |        234        2.26       92.74
         71 |        230        2.22       94.96
         72 |        207        2.00       96.96
         73 |        156        1.51       98.46
         74 |        159        1.54      100.00
------------+-----------------------------------
      Total |     10,351      100.00

. tab age weight
too many values
r(134);

. dtable age weight, by(region)

-------------------------------------------------------------------------------------------
                                                 Region                                    
                   NE              MW              S               W             Total     
-------------------------------------------------------------------------------------------
N             2,096 (20.2%)   2,774 (26.8%)   2,853 (27.6%)   2,628 (25.4%) 10,351 (100.0%)
Age (years) 47.816 (17.017) 46.528 (17.376) 48.191 (16.864) 47.838 (17.535) 47.580 (17.215)
Weight (kg) 71.646 (14.922) 72.050 (15.340) 72.035 (15.655) 71.787 (15.393) 71.898 (15.356)
-------------------------------------------------------------------------------------------

. des

Contains data from https://www.stata-press.com/data/r18/nhanes2l.dta
 Observations:        10,351                  Second National Health and Nutrition Examination Survey
    Variables:            42                  23 Mar 2023 10:43
---------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------------------------
sampl           long    %9.0g                 Unique case identifier
strata          byte    %9.0g                 Stratum identifier
psu             byte    %9.0g      psulbl     Primary sampling unit
region          byte    %9.0g      region     Region
smsa            byte    %22.0g     smsalbl    SMSA type
location        byte    %9.0g                 Location (stand office ID)
houssiz         byte    %9.0g                 Number of people in household
sex             byte    %9.0g      sex        Sex
race            byte    %9.0g      race       Race
age             byte    %9.0g                 Age (years)
height          float   %9.0g                 Height (cm)
weight          float   %9.0g                 Weight (kg)
bpsystol        int     %9.0g                 Systolic blood pressure
bpdiast         int     %9.0g                 Diastolic blood pressure
tcresult        int     %9.0g                 Serum cholesterol (mg/dL)
tgresult        int     %9.0g                 Serum triglycerides (mg/dL)
hdresult        int     %9.0g                 High-density lipids (mg/dL)
hgb             float   %9.0g                 Hemoglobin (g/dL)
hct             float   %9.0g                 Hematocrit (%)
tibc            int     %9.0g                 Total iron bind. cap. (mcg/dL)
iron            int     %9.0g                 Serum iron (mcg/dL)
hlthstat        byte    %20.0g     hlth       Health status
heartatk        byte    %16.0g     heartlbl   Prior heart attack
diabetes        byte    %12.0g     diabetes   Diabetes status
sizplace        byte    %39.0g     size       Size of place
finalwgt        long    %9.0g                 Sampling weight (except lead)
leadwt          long    %9.0g                 Sampling weight for lead
corpuscl        float   %9.0g                 Mean corpuscular volume (fL)
trnsfern        float   %9.0g                 Transferrin saturation (%)
albumin         float   %9.0g                 Serum albumin (g/dL)
vitaminc        float   %9.0g                 Serum vitamin C (mg/dL)
zinc            int     %9.0g                 Serum zinc (mcg/dL)
copper          int     %9.0g                 Serum copper (mcg/dL)
porphyrn        int     %9.0g                 Erythrocyte porphyrin (mcg/dl)
lead            byte    %9.0g                 Lead (mcg/dL)
hsizgp          byte    %8.0g                 # in household or 5 if #>=5
rural           byte    %8.0g      rurallbl   Rural
loglead         float   %9.0g                 log(lead)
agegrp          byte    %8.0g      agegrp     Age group
highlead        byte    %10.0g     highlead   High lead level
bmi             float   %9.0g                 Body mass index (BMI)
highbp          byte    %8.0g               * High blood pressure
                                            * indicated variables have notes
---------------------------------------------------------------------------------------------------------------------------------
Sorted by: region

. do "C:\Users\user\AppData\Local\Temp\STD22fc_000000.tmp"

. 
. dtable weight, by(sex) export("outputs/table_by_sex.tex")

-----------------------------------------------------------
                                  Sex                      
                  Male           Female          Total     
-----------------------------------------------------------
N             4,915 (47.5%)   5,436 (52.5%) 10,351 (100.0%)
Weight (kg) 77.984 (13.638) 66.394 (14.735) 71.898 (15.356)
-----------------------------------------------------------
(collection DTable exported to file outputs/table_by_sex.tex)

. 
end of do-file

. reg bpsystol age, ro

Linear regression                               Number of obs     =     10,351
                                                F(1, 10349)       =    3044.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2315
                                                Root MSE          =     20.456

------------------------------------------------------------------------------
             |               Robust
    bpsystol | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |   .6520775   .0118175    55.18   0.000     .6289129     .675242
       _cons |   99.85603   .5262466   189.75   0.000     98.82449    100.8876
------------------------------------------------------------------------------

. estimates store model2

. etable, estimates(model2) keep(_cons age) showstars title(Model 2) note(Elaborado por LIDE.) export("output/ejemplo_latex_reg_e
> n_clase", as(tex) replace)

Model 2
---------------------------------
                        bpsystol 
---------------------------------
Intercept               99.856 **
                       (0.526)   
Age (years)              0.652 **
                       (0.012)   
Number of observations   10351   
---------------------------------
Elaborado por LIDE.
file output/ejemplo_latex_reg_en_clase.tex could not be opened
                 fopen():   603  file could not be opened
   _collect_export_tex():     -  function returned error
                 <istmt>:     -  function returned error
r(603);

. do "C:\Users\user\AppData\Local\Temp\STD22fc_000000.tmp"

. reg bpsystol age, ro

Linear regression                               Number of obs     =     10,351
                                                F(1, 10349)       =    3044.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2315
                                                Root MSE          =     20.456

------------------------------------------------------------------------------
             |               Robust
    bpsystol | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |   .6520775   .0118175    55.18   0.000     .6289129     .675242
       _cons |   99.85603   .5262466   189.75   0.000     98.82449    100.8876
------------------------------------------------------------------------------

. 
. estimates store model2

. 
. etable, estimates(model2) keep(_cons age) showstars title(Model 2) note(Elaborado por LIDE.) export("outputs/ejemplo_latex_reg_
> en_clase", as(tex) replace)

Model 2
---------------------------------
                        bpsystol 
---------------------------------
Intercept               99.856 **
                       (0.526)   
Age (years)              0.652 **
                       (0.012)   
Number of observations   10351   
---------------------------------
Elaborado por LIDE.
(collection ETable exported to file outputs/ejemplo_latex_reg_en_clase.tex)

. 
end of do-file

. table ( region ) () ( bpsystol )

Systolic blood pressure = 65
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          1
  Total |          1
--------------------

Systolic blood pressure = 70
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          1
  Total |          1
--------------------

Systolic blood pressure = 75
--------------------
        |  Frequency
--------+-----------
Region  |           
  S     |          1
  Total |          1
--------------------

Systolic blood pressure = 78
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          2
  W     |          1
  Total |          3
--------------------

Systolic blood pressure = 80
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  S     |          5
  W     |          4
  Total |         10
--------------------

Systolic blood pressure = 82
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  S     |          2
  W     |          3
  Total |          6
--------------------

Systolic blood pressure = 84
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          2
  MW    |          1
  S     |          1
  Total |          4
--------------------

Systolic blood pressure = 85
--------------------
        |  Frequency
--------+-----------
Region  |           
  W     |          1
  Total |          1
--------------------

Systolic blood pressure = 86
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  MW    |          1
  S     |          1
  W     |          1
  Total |          4
--------------------

Systolic blood pressure = 88
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          5
  MW    |          1
  S     |          2
  W     |          8
  Total |         16
--------------------

Systolic blood pressure = 90
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         31
  MW    |         26
  S     |         35
  W     |         16
  Total |        108
--------------------

Systolic blood pressure = 92
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          2
  MW    |          5
  S     |          4
  W     |          5
  Total |         16
--------------------

Systolic blood pressure = 93
--------------------
        |  Frequency
--------+-----------
Region  |           
  S     |          1
  Total |          1
--------------------

Systolic blood pressure = 94
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          9
  MW    |          9
  S     |         15
  W     |          8
  Total |         41
--------------------

Systolic blood pressure = 95
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          5
  MW    |          4
  W     |         10
  Total |         19
--------------------

Systolic blood pressure = 96
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         10
  MW    |         22
  S     |         21
  W     |         14
  Total |         67
--------------------

Systolic blood pressure = 98
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         19
  MW    |         16
  S     |         24
  W     |         28
  Total |         87
--------------------

Systolic blood pressure = 100
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         89
  MW    |        102
  S     |        125
  W     |         79
  Total |        395
--------------------

Systolic blood pressure = 102
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         14
  MW    |         26
  S     |         26
  W     |         26
  Total |         92
--------------------

Systolic blood pressure = 104
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         34
  MW    |         41
  S     |         45
  W     |         45
  Total |        165
--------------------

Systolic blood pressure = 105
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         14
  MW    |          7
  S     |          5
  W     |         22
  Total |         48
--------------------

Systolic blood pressure = 106
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         31
  MW    |         33
  S     |         61
  W     |         32
  Total |        157
--------------------

Systolic blood pressure = 108
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         23
  MW    |         39
  S     |         41
  W     |         58
  Total |        161
--------------------

Systolic blood pressure = 109
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          2
  W     |          2
  Total |          4
--------------------

Systolic blood pressure = 110
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |        171
  MW    |        253
  S     |        219
  W     |        191
  Total |        834
--------------------

Systolic blood pressure = 112
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         42
  MW    |         39
  S     |         48
  W     |         53
  Total |        182
--------------------

Systolic blood pressure = 114
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         33
  MW    |         67
  S     |         52
  W     |         55
  Total |        207
--------------------

Systolic blood pressure = 115
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         19
  MW    |         14
  S     |          3
  W     |         16
  Total |         52
--------------------

Systolic blood pressure = 116
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         27
  MW    |         49
  S     |         77
  W     |         42
  Total |        195
--------------------

Systolic blood pressure = 117
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  Total |          1
--------------------

Systolic blood pressure = 118
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         52
  MW    |         64
  S     |         67
  W     |         75
  Total |        258
--------------------

Systolic blood pressure = 119
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  MW    |          1
  S     |          1
  W     |          1
  Total |          4
--------------------

Systolic blood pressure = 120
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |        231
  MW    |        347
  S     |        295
  W     |        226
  Total |      1,099
--------------------

Systolic blood pressure = 122
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         27
  MW    |         46
  S     |         36
  W     |         61
  Total |        170
--------------------

Systolic blood pressure = 124
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         48
  MW    |         63
  S     |         66
  W     |         86
  Total |        263
--------------------

Systolic blood pressure = 125
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          8
  MW    |         11
  S     |          4
  W     |         20
  Total |         43
--------------------

Systolic blood pressure = 126
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         40
  MW    |         67
  S     |         85
  W     |         68
  Total |        260
--------------------

Systolic blood pressure = 128
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         49
  MW    |         63
  S     |         73
  W     |         87
  Total |        272
--------------------

Systolic blood pressure = 129
--------------------
        |  Frequency
--------+-----------
Region  |           
  W     |          1
  Total |          1
--------------------

Systolic blood pressure = 130
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |        182
  MW    |        236
  S     |        252
  W     |        208
  Total |        878
--------------------

Systolic blood pressure = 132
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         27
  MW    |         52
  S     |         42
  W     |         52
  Total |        173
--------------------

Systolic blood pressure = 134
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         27
  MW    |         60
  S     |         62
  W     |         67
  Total |        216
--------------------

Systolic blood pressure = 135
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         16
  MW    |          6
  S     |          1
  W     |         16
  Total |         39
--------------------

Systolic blood pressure = 136
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         25
  MW    |         71
  S     |         89
  W     |         71
  Total |        256
--------------------

Systolic blood pressure = 138
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         45
  MW    |         53
  S     |         36
  W     |         65
  Total |        199
--------------------

Systolic blood pressure = 139
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          1
  S     |          1
  Total |          2
--------------------

Systolic blood pressure = 140
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |        170
  MW    |        196
  S     |        189
  W     |        142
  Total |        697
--------------------

Systolic blood pressure = 142
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         22
  MW    |         38
  S     |         27
  W     |         34
  Total |        121
--------------------

Systolic blood pressure = 144
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         22
  MW    |         20
  S     |         27
  W     |         28
  Total |         97
--------------------

Systolic blood pressure = 145
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          6
  MW    |          4
  S     |          1
  W     |         11
  Total |         22
--------------------

Systolic blood pressure = 146
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         20
  MW    |         38
  S     |         46
  W     |         40
  Total |        144
--------------------

Systolic blood pressure = 148
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         29
  MW    |         35
  S     |         38
  W     |         35
  Total |        137
--------------------

Systolic blood pressure = 149
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          1
  Total |          1
--------------------

Systolic blood pressure = 150
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |        125
  MW    |        139
  S     |        126
  W     |        113
  Total |        503
--------------------

Systolic blood pressure = 152
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          8
  MW    |         12
  S     |          8
  W     |         14
  Total |         42
--------------------

Systolic blood pressure = 153
--------------------
        |  Frequency
--------+-----------
Region  |           
  W     |          1
  Total |          1
--------------------

Systolic blood pressure = 154
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         18
  MW    |         25
  S     |         36
  W     |         26
  Total |        105
--------------------

Systolic blood pressure = 155
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          6
  MW    |          3
  W     |         11
  Total |         20
--------------------

Systolic blood pressure = 156
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         11
  MW    |         14
  S     |         48
  W     |         17
  Total |         90
--------------------

Systolic blood pressure = 158
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         18
  MW    |         20
  S     |         19
  W     |         27
  Total |         84
--------------------

Systolic blood pressure = 160
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         74
  MW    |         97
  S     |         77
  W     |         68
  Total |        316
--------------------

Systolic blood pressure = 162
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          8
  MW    |          6
  S     |          6
  W     |          7
  Total |         27
--------------------

Systolic blood pressure = 164
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         11
  MW    |         10
  S     |         20
  W     |         18
  Total |         59
--------------------

Systolic blood pressure = 165
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          3
  W     |          6
  Total |          9
--------------------

Systolic blood pressure = 166
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          6
  MW    |         13
  S     |         14
  W     |         14
  Total |         47
--------------------

Systolic blood pressure = 168
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          8
  MW    |         15
  S     |         14
  W     |         16
  Total |         53
--------------------

Systolic blood pressure = 170
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         46
  MW    |         57
  S     |         57
  W     |         48
  Total |        208
--------------------

Systolic blood pressure = 172
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          6
  MW    |          6
  S     |          6
  W     |          3
  Total |         21
--------------------

Systolic blood pressure = 174
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          6
  MW    |          7
  S     |          8
  W     |          5
  Total |         26
--------------------

Systolic blood pressure = 175
--------------------
        |  Frequency
--------+-----------
Region  |           
  W     |          3
  Total |          3
--------------------

Systolic blood pressure = 176
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          6
  MW    |          7
  S     |         13
  W     |          6
  Total |         32
--------------------

Systolic blood pressure = 178
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          4
  MW    |          6
  S     |          4
  W     |          9
  Total |         23
--------------------

Systolic blood pressure = 180
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         29
  MW    |         31
  S     |         38
  W     |         33
  Total |        131
--------------------

Systolic blood pressure = 182
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  MW    |          3
  S     |          6
  W     |          2
  Total |         12
--------------------

Systolic blood pressure = 184
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          3
  MW    |          7
  S     |          4
  W     |          8
  Total |         22
--------------------

Systolic blood pressure = 185
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          2
  W     |          1
  Total |          3
--------------------

Systolic blood pressure = 186
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          3
  MW    |          3
  S     |         12
  W     |          3
  Total |         21
--------------------

Systolic blood pressure = 187
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  Total |          1
--------------------

Systolic blood pressure = 188
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          3
  MW    |          2
  S     |          4
  W     |          3
  Total |         12
--------------------

Systolic blood pressure = 190
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |         18
  MW    |         19
  S     |         17
  W     |         18
  Total |         72
--------------------

Systolic blood pressure = 192
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          2
  MW    |          1
  W     |          1
  Total |          4
--------------------

Systolic blood pressure = 194
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          2
  MW    |          3
  S     |          6
  Total |         11
--------------------

Systolic blood pressure = 195
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  Total |          1
--------------------

Systolic blood pressure = 196
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  MW    |          2
  S     |          6
  W     |          1
  Total |         10
--------------------

Systolic blood pressure = 198
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          2
  MW    |          1
  S     |          6
  Total |          9
--------------------

Systolic blood pressure = 200
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          8
  MW    |          9
  S     |         17
  W     |         18
  Total |         52
--------------------

Systolic blood pressure = 204
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  MW    |          1
  S     |          3
  W     |          1
  Total |          6
--------------------

Systolic blood pressure = 205
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  Total |          1
--------------------

Systolic blood pressure = 206
--------------------
        |  Frequency
--------+-----------
Region  |           
  S     |          2
  Total |          2
--------------------

Systolic blood pressure = 208
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          4
  Total |          4
--------------------

Systolic blood pressure = 210
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          6
  MW    |          5
  S     |          2
  W     |          5
  Total |         18
--------------------

Systolic blood pressure = 212
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          2
  MW    |          1
  S     |          2
  Total |          5
--------------------

Systolic blood pressure = 214
--------------------
        |  Frequency
--------+-----------
Region  |           
  S     |          1
  Total |          1
--------------------

Systolic blood pressure = 216
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          2
  S     |          2
  W     |          1
  Total |          5
--------------------

Systolic blood pressure = 217
--------------------
        |  Frequency
--------+-----------
Region  |           
  S     |          1
  Total |          1
--------------------

Systolic blood pressure = 218
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          2
  S     |          1
  Total |          3
--------------------

Systolic blood pressure = 220
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          5
  MW    |          3
  S     |          6
  W     |          6
  Total |         20
--------------------

Systolic blood pressure = 222
--------------------
        |  Frequency
--------+-----------
Region  |           
  S     |          1
  Total |          1
--------------------

Systolic blood pressure = 224
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          1
  S     |          2
  Total |          3
--------------------

Systolic blood pressure = 226
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          1
  S     |          1
  Total |          2
--------------------

Systolic blood pressure = 230
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          4
  MW    |          2
  S     |          1
  Total |          7
--------------------

Systolic blood pressure = 234
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  S     |          1
  Total |          2
--------------------

Systolic blood pressure = 236
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          1
  Total |          1
--------------------

Systolic blood pressure = 240
--------------------
        |  Frequency
--------+-----------
Region  |           
  S     |          1
  Total |          1
--------------------

Systolic blood pressure = 254
--------------------
        |  Frequency
--------+-----------
Region  |           
  MW    |          1
  Total |          1
--------------------

Systolic blood pressure = 260
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  W     |          1
  Total |          2
--------------------

Systolic blood pressure = 270
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  S     |          2
  Total |          3
--------------------

Systolic blood pressure = 300
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |          1
  Total |          1
--------------------

Systolic blood pressure = Total
--------------------
        |  Frequency
--------+-----------
Region  |           
  NE    |      2,096
  MW    |      2,774
  S     |      2,853
  W     |      2,628
  Total |     10,351
--------------------

. exit, clear
